Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/include/pio/pic32cm5164jh01064.h
#define PIN_PA11B_ADC0_AIN11                       _UL_(11)    
#define MUX_PA11B_ADC0_AIN11                       _UL_(1)     
#define PINMUX_PA11B_ADC0_AIN11                    ((PIN_PA11B_ADC0_AIN11 << 16) | MUX_PA11B_ADC0_AIN11)
#define PORT_PA11B_ADC0_AIN11                      (_UL_(1) << 11)

#define PIN_PA03B_ADC0_VREFP                       _UL_(3)     
#define MUX_PA03B_ADC0_VREFP                       _UL_(1)     
#define PINMUX_PA03B_ADC0_VREFP                    ((PIN_PA03B_ADC0_VREFP << 16) | MUX_PA03B_ADC0_VREFP)
#define PORT_PA03B_ADC0_VREFP                      (_UL_(1) << 3)

/* ========== PORT definition for ADC1 peripheral ========== */
#define PIN_PB00B_ADC1_AIN0                        _UL_(32)    
#define MUX_PB00B_ADC1_AIN0                        _UL_(1)     
#define PINMUX_PB00B_ADC1_AIN0                     ((PIN_PB00B_ADC1_AIN0 << 16) | MUX_PB00B_ADC1_AIN0)
#define PORT_PB00B_ADC1_AIN0                       (_UL_(1) << 0)

#define PIN_PB01B_ADC1_AIN1                        _UL_(33)    
#define MUX_PB01B_ADC1_AIN1                        _UL_(1)     
#define PINMUX_PB01B_ADC1_AIN1                     ((PIN_PB01B_ADC1_AIN1 << 16) | MUX_PB01B_ADC1_AIN1)
#define PORT_PB01B_ADC1_AIN1                       (_UL_(1) << 1)

#define PIN_PB02B_ADC1_AIN2                        _UL_(34)    
#define MUX_PB02B_ADC1_AIN2                        _UL_(1)     
#define PINMUX_PB02B_ADC1_AIN2                     ((PIN_PB02B_ADC1_AIN2 << 16) | MUX_PB02B_ADC1_AIN2)
#define PORT_PB02B_ADC1_AIN2                       (_UL_(1) << 2)

#define PIN_PB03B_ADC1_AIN3                        _UL_(35)    
#define MUX_PB03B_ADC1_AIN3                        _UL_(1)     
#define PINMUX_PB03B_ADC1_AIN3                     ((PIN_PB03B_ADC1_AIN3 << 16) | MUX_PB03B_ADC1_AIN3)
#define PORT_PB03B_ADC1_AIN3                       (_UL_(1) << 3)

#define PIN_PB08B_ADC1_AIN4                        _UL_(40)    
#define MUX_PB08B_ADC1_AIN4                        _UL_(1)     
#define PINMUX_PB08B_ADC1_AIN4                     ((PIN_PB08B_ADC1_AIN4 << 16) | MUX_PB08B_ADC1_AIN4)
#define PORT_PB08B_ADC1_AIN4                       (_UL_(1) << 8)

#define PIN_PB09B_ADC1_AIN5                        _UL_(41)    
#define MUX_PB09B_ADC1_AIN5                        _UL_(1)     
#define PINMUX_PB09B_ADC1_AIN5                     ((PIN_PB09B_ADC1_AIN5 << 16) | MUX_PB09B_ADC1_AIN5)
#define PORT_PB09B_ADC1_AIN5                       (_UL_(1) << 9)

#define PIN_PB04B_ADC1_AIN6                        _UL_(36)    
#define MUX_PB04B_ADC1_AIN6                        _UL_(1)     
#define PINMUX_PB04B_ADC1_AIN6                     ((PIN_PB04B_ADC1_AIN6 << 16) | MUX_PB04B_ADC1_AIN6)
#define PORT_PB04B_ADC1_AIN6                       (_UL_(1) << 4)

#define PIN_PB05B_ADC1_AIN7                        _UL_(37)    
#define MUX_PB05B_ADC1_AIN7                        _UL_(1)     
#define PINMUX_PB05B_ADC1_AIN7                     ((PIN_PB05B_ADC1_AIN7 << 16) | MUX_PB05B_ADC1_AIN7)
#define PORT_PB05B_ADC1_AIN7                       (_UL_(1) << 5)

#define PIN_PB06B_ADC1_AIN8                        _UL_(38)    
#define MUX_PB06B_ADC1_AIN8                        _UL_(1)     
#define PINMUX_PB06B_ADC1_AIN8                     ((PIN_PB06B_ADC1_AIN8 << 16) | MUX_PB06B_ADC1_AIN8)
#define PORT_PB06B_ADC1_AIN8                       (_UL_(1) << 6)

#define PIN_PB07B_ADC1_AIN9                        _UL_(39)    
#define MUX_PB07B_ADC1_AIN9                        _UL_(1)     
#define PINMUX_PB07B_ADC1_AIN9                     ((PIN_PB07B_ADC1_AIN9 << 16) | MUX_PB07B_ADC1_AIN9)
#define PORT_PB07B_ADC1_AIN9                       (_UL_(1) << 7)

#define PIN_PA08B_ADC1_AIN10                       _UL_(8)     
#define MUX_PA08B_ADC1_AIN10                       _UL_(1)     
#define PINMUX_PA08B_ADC1_AIN10                    ((PIN_PA08B_ADC1_AIN10 << 16) | MUX_PA08B_ADC1_AIN10)
#define PORT_PA08B_ADC1_AIN10                      (_UL_(1) << 8)

#define PIN_PA09B_ADC1_AIN11                       _UL_(9)     
#define MUX_PA09B_ADC1_AIN11                       _UL_(1)     
#define PINMUX_PA09B_ADC1_AIN11                    ((PIN_PA09B_ADC1_AIN11 << 16) | MUX_PA09B_ADC1_AIN11)
#define PORT_PA09B_ADC1_AIN11                      (_UL_(1) << 9)

/* ========== PORT definition for CAN0 peripheral ========== */
#define PIN_PA25G_CAN0_RX                          _UL_(25)    
#define MUX_PA25G_CAN0_RX                          _UL_(6)     
#define PINMUX_PA25G_CAN0_RX                       ((PIN_PA25G_CAN0_RX << 16) | MUX_PA25G_CAN0_RX)
#define PORT_PA25G_CAN0_RX                         (_UL_(1) << 25)

#define PIN_PB23G_CAN0_RX                          _UL_(55)    
#define MUX_PB23G_CAN0_RX                          _UL_(6)     
#define PINMUX_PB23G_CAN0_RX                       ((PIN_PB23G_CAN0_RX << 16) | MUX_PB23G_CAN0_RX)
#define PORT_PB23G_CAN0_RX                         (_UL_(1) << 23)

#define PIN_PA24G_CAN0_TX                          _UL_(24)    
#define MUX_PA24G_CAN0_TX                          _UL_(6)     
#define PINMUX_PA24G_CAN0_TX                       ((PIN_PA24G_CAN0_TX << 16) | MUX_PA24G_CAN0_TX)
#define PORT_PA24G_CAN0_TX                         (_UL_(1) << 24)

#define PIN_PB22G_CAN0_TX                          _UL_(54)    
#define MUX_PB22G_CAN0_TX                          _UL_(6)     
#define PINMUX_PB22G_CAN0_TX                       ((PIN_PB22G_CAN0_TX << 16) | MUX_PB22G_CAN0_TX)
#define PORT_PB22G_CAN0_TX                         (_UL_(1) << 22)

/* ========== PORT definition for CAN1 peripheral ========== */
#define PIN_PB11G_CAN1_RX                          _UL_(43)    
#define MUX_PB11G_CAN1_RX                          _UL_(6)     
#define PINMUX_PB11G_CAN1_RX                       ((PIN_PB11G_CAN1_RX << 16) | MUX_PB11G_CAN1_RX)
#define PORT_PB11G_CAN1_RX                         (_UL_(1) << 11)

#define PIN_PB15G_CAN1_RX                          _UL_(47)    
#define MUX_PB15G_CAN1_RX                          _UL_(6)     
#define PINMUX_PB15G_CAN1_RX                       ((PIN_PB15G_CAN1_RX << 16) | MUX_PB15G_CAN1_RX)
#define PORT_PB15G_CAN1_RX                         (_UL_(1) << 15)

#define PIN_PB10G_CAN1_TX                          _UL_(42)    
#define MUX_PB10G_CAN1_TX                          _UL_(6)     
#define PINMUX_PB10G_CAN1_TX                       ((PIN_PB10G_CAN1_TX << 16) | MUX_PB10G_CAN1_TX)
#define PORT_PB10G_CAN1_TX                         (_UL_(1) << 10)

#define PIN_PB14G_CAN1_TX                          _UL_(46)    
#define MUX_PB14G_CAN1_TX                          _UL_(6)     
#define PINMUX_PB14G_CAN1_TX                       ((PIN_PB14G_CAN1_TX << 16) | MUX_PB14G_CAN1_TX)
#define PORT_PB14G_CAN1_TX                         (_UL_(1) << 14)

/* ========== PORT definition for CCL peripheral ========== */
#define PIN_PA04I_CCL_IN0                          _UL_(4)     
#define MUX_PA04I_CCL_IN0                          _UL_(8)     
#define PINMUX_PA04I_CCL_IN0                       ((PIN_PA04I_CCL_IN0 << 16) | MUX_PA04I_CCL_IN0)
#define PORT_PA04I_CCL_IN0                         (_UL_(1) << 4)

#define PIN_PA16I_CCL_IN0                          _UL_(16)    
#define MUX_PA16I_CCL_IN0                          _UL_(8)     
#define PINMUX_PA16I_CCL_IN0                       ((PIN_PA16I_CCL_IN0 << 16) | MUX_PA16I_CCL_IN0)
#define PORT_PA16I_CCL_IN0                         (_UL_(1) << 16)

