Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/include/pio/pic32cm5164jh01064.h
#define PIN_PB16E_TC2_WO0                          _UL_(48)    
#define MUX_PB16E_TC2_WO0                          _UL_(4)     
#define PINMUX_PB16E_TC2_WO0                       ((PIN_PB16E_TC2_WO0 << 16) | MUX_PB16E_TC2_WO0)
#define PORT_PB16E_TC2_WO0                         (_UL_(1) << 16)

#define PIN_PB03E_TC2_WO1                          _UL_(35)    
#define MUX_PB03E_TC2_WO1                          _UL_(4)     
#define PINMUX_PB03E_TC2_WO1                       ((PIN_PB03E_TC2_WO1 << 16) | MUX_PB03E_TC2_WO1)
#define PORT_PB03E_TC2_WO1                         (_UL_(1) << 3)

#define PIN_PB17E_TC2_WO1                          _UL_(49)    
#define MUX_PB17E_TC2_WO1                          _UL_(4)     
#define PINMUX_PB17E_TC2_WO1                       ((PIN_PB17E_TC2_WO1 << 16) | MUX_PB17E_TC2_WO1)
#define PORT_PB17E_TC2_WO1                         (_UL_(1) << 17)

/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_PA20E_TC3_WO0                          _UL_(20)    
#define MUX_PA20E_TC3_WO0                          _UL_(4)     
#define PINMUX_PA20E_TC3_WO0                       ((PIN_PA20E_TC3_WO0 << 16) | MUX_PA20E_TC3_WO0)
#define PORT_PA20E_TC3_WO0                         (_UL_(1) << 20)

#define PIN_PB00E_TC3_WO0                          _UL_(32)    
#define MUX_PB00E_TC3_WO0                          _UL_(4)     
#define PINMUX_PB00E_TC3_WO0                       ((PIN_PB00E_TC3_WO0 << 16) | MUX_PB00E_TC3_WO0)
#define PORT_PB00E_TC3_WO0                         (_UL_(1) << 0)

#define PIN_PB22E_TC3_WO0                          _UL_(54)    
#define MUX_PB22E_TC3_WO0                          _UL_(4)     
#define PINMUX_PB22E_TC3_WO0                       ((PIN_PB22E_TC3_WO0 << 16) | MUX_PB22E_TC3_WO0)
#define PORT_PB22E_TC3_WO0                         (_UL_(1) << 22)

#define PIN_PA21E_TC3_WO1                          _UL_(21)    
#define MUX_PA21E_TC3_WO1                          _UL_(4)     
#define PINMUX_PA21E_TC3_WO1                       ((PIN_PA21E_TC3_WO1 << 16) | MUX_PA21E_TC3_WO1)
#define PORT_PA21E_TC3_WO1                         (_UL_(1) << 21)

#define PIN_PB01E_TC3_WO1                          _UL_(33)    
#define MUX_PB01E_TC3_WO1                          _UL_(4)     
#define PINMUX_PB01E_TC3_WO1                       ((PIN_PB01E_TC3_WO1 << 16) | MUX_PB01E_TC3_WO1)
#define PORT_PB01E_TC3_WO1                         (_UL_(1) << 1)

#define PIN_PB23E_TC3_WO1                          _UL_(55)    
#define MUX_PB23E_TC3_WO1                          _UL_(4)     
#define PINMUX_PB23E_TC3_WO1                       ((PIN_PB23E_TC3_WO1 << 16) | MUX_PB23E_TC3_WO1)
#define PORT_PB23E_TC3_WO1                         (_UL_(1) << 23)

/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_PA18E_TC4_WO0                          _UL_(18)    
#define MUX_PA18E_TC4_WO0                          _UL_(4)     
#define PINMUX_PA18E_TC4_WO0                       ((PIN_PA18E_TC4_WO0 << 16) | MUX_PA18E_TC4_WO0)
#define PORT_PA18E_TC4_WO0                         (_UL_(1) << 18)

#define PIN_PA14E_TC4_WO0                          _UL_(14)    
#define MUX_PA14E_TC4_WO0                          _UL_(4)     
#define PINMUX_PA14E_TC4_WO0                       ((PIN_PA14E_TC4_WO0 << 16) | MUX_PA14E_TC4_WO0)
#define PORT_PA14E_TC4_WO0                         (_UL_(1) << 14)

#define PIN_PA19E_TC4_WO1                          _UL_(19)    
#define MUX_PA19E_TC4_WO1                          _UL_(4)     
#define PINMUX_PA19E_TC4_WO1                       ((PIN_PA19E_TC4_WO1 << 16) | MUX_PA19E_TC4_WO1)
#define PORT_PA19E_TC4_WO1                         (_UL_(1) << 19)

#define PIN_PA15E_TC4_WO1                          _UL_(15)    
#define MUX_PA15E_TC4_WO1                          _UL_(4)     
#define PINMUX_PA15E_TC4_WO1                       ((PIN_PA15E_TC4_WO1 << 16) | MUX_PA15E_TC4_WO1)
#define PORT_PA15E_TC4_WO1                         (_UL_(1) << 15)

/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_PA04F_TC5_WO0                          _UL_(4)     
#define MUX_PA04F_TC5_WO0                          _UL_(5)     
#define PINMUX_PA04F_TC5_WO0                       ((PIN_PA04F_TC5_WO0 << 16) | MUX_PA04F_TC5_WO0)
#define PORT_PA04F_TC5_WO0                         (_UL_(1) << 4)

#define PIN_PB02F_TC5_WO0                          _UL_(34)    
#define MUX_PB02F_TC5_WO0                          _UL_(5)     
#define PINMUX_PB02F_TC5_WO0                       ((PIN_PB02F_TC5_WO0 << 16) | MUX_PB02F_TC5_WO0)
#define PORT_PB02F_TC5_WO0                         (_UL_(1) << 2)

#define PIN_PA05F_TC5_WO1                          _UL_(5)     
#define MUX_PA05F_TC5_WO1                          _UL_(5)     
#define PINMUX_PA05F_TC5_WO1                       ((PIN_PA05F_TC5_WO1 << 16) | MUX_PA05F_TC5_WO1)
#define PORT_PA05F_TC5_WO1                         (_UL_(1) << 5)

#define PIN_PB03F_TC5_WO1                          _UL_(35)    
#define MUX_PB03F_TC5_WO1                          _UL_(5)     
#define PINMUX_PB03F_TC5_WO1                       ((PIN_PB03F_TC5_WO1 << 16) | MUX_PB03F_TC5_WO1)
#define PORT_PB03F_TC5_WO1                         (_UL_(1) << 3)

/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PA06F_TC6_WO0                          _UL_(6)     
#define MUX_PA06F_TC6_WO0                          _UL_(5)     
#define PINMUX_PA06F_TC6_WO0                       ((PIN_PA06F_TC6_WO0 << 16) | MUX_PA06F_TC6_WO0)
#define PORT_PA06F_TC6_WO0                         (_UL_(1) << 6)

#define PIN_PB00F_TC6_WO0                          _UL_(32)    
#define MUX_PB00F_TC6_WO0                          _UL_(5)     
#define PINMUX_PB00F_TC6_WO0                       ((PIN_PB00F_TC6_WO0 << 16) | MUX_PB00F_TC6_WO0)
#define PORT_PB00F_TC6_WO0                         (_UL_(1) << 0)

#define PIN_PA07F_TC6_WO1                          _UL_(7)     
#define MUX_PA07F_TC6_WO1                          _UL_(5)     
#define PINMUX_PA07F_TC6_WO1                       ((PIN_PA07F_TC6_WO1 << 16) | MUX_PA07F_TC6_WO1)
#define PORT_PA07F_TC6_WO1                         (_UL_(1) << 7)

